package com.arshana.raje.newActivity;

import android.content.DialogInterface;
import android.content.Intent;
import android.graphics.Color;
import android.graphics.drawable.Drawable;
import android.net.Uri;
import android.os.Build;
import android.os.Bundle;
import android.speech.tts.TextToSpeech;
import android.view.View;
import android.widget.ArrayAdapter;
import android.widget.ImageView;
import android.widget.LinearLayout;
import android.widget.Toast;

import androidx.appcompat.app.AlertDialog;
import androidx.appcompat.app.AppCompatActivity;
import androidx.core.view.GravityCompat;
import androidx.drawerlayout.widget.DrawerLayout;
import androidx.fragment.app.Fragment;
import androidx.fragment.app.FragmentManager;
import androidx.fragment.app.FragmentPagerAdapter;
import androidx.recyclerview.widget.DefaultItemAnimator;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;
import androidx.viewpager.widget.ViewPager;

import com.arshana.raje.Adapter.IndexAdapter;
import com.arshana.raje.Constant.Constant;
import com.arshana.raje.Fragment.BookPageIntroFragment;
import com.arshana.raje.R;
import com.arshana.raje.data.InitViews;
import com.arshana.raje.sharedPref.SharedPref;
import com.elconfidencial.bubbleshowcase.BubbleShowCase;
import com.elconfidencial.bubbleshowcase.BubbleShowCaseBuilder;
import com.elconfidencial.bubbleshowcase.BubbleShowCaseSequence;
import com.facebook.ads.AdView;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.Locale;


public class HistoryActivity extends AppCompatActivity {

    RecyclerView rec_index;
    String[] id, content, titles;
    AlertDialog.Builder builderSingle;
    DrawerLayout drawer_layout;
    ImageView img_share;

    String p1, p2, p3, p4, p7, p8, p9, p12, p13, p14, p15, p16, p17, p18, p19, p20, p21, p22, p23, p24, p26, p27, p29, p30, p31;
    String t1, t2, t3, t4, t7, t8, t9, t12, t13, t14, t15, t16, t17, t18, t19, t20, t21, t22, t23, t24, t26, t27, t29, t30, t31;
    int current_Speak_position = 0;
    TextToSpeech tts;
    String toSpeak;
    HashMap<String, String> ttsParams;
    AdView adView;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_history);
        LinearLayout adContainer = findViewById(R.id.banner_container);
        adView = InitViews.initBanner(getApplicationContext(), adContainer, com.arshana.raje.data.Constant.HISTORY_BANNER);

        ImageView img_back;
        img_back = findViewById(R.id.img_back);
        img_share = findViewById(R.id.img_share);

        img_back.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                onBackPressed();
            }
        });
        init();
    }
    @Override
    protected void onDestroy() {
        if (adView != null) {
            adView.destroy();
        }
        super.onDestroy();
    }

    @Override
    public void onBackPressed() {
        super.onBackPressed();
        if (tts != null) {
            tts.shutdown();
        }
        finish();

    }


    private void init() {

        t1 = "छत्रपती शिवाजी महाराज यांचा जन्म";
        t2 = "छत्रपती शिवाजी महाराज यांचे कुटुंब";
        t3 = "मार्गदर्शक";
        t4 = "शिवाजी महाराजांचे सरसेनापती";
        t7 = "पहिली स्वारी - तोरणगडावर विजय";
        t8 = "शहाजीराजांना अटक";
        t9 = "जावळी प्रकरण";
        t12 = "अफझलखान प्रकरण";
        t13 = "प्रतापगडाची लढाई";
        t14 = "कोल्हापूरची लढाई";
        t15 = "सिद्दी जौहरचे आक्रमण";
        t16 = "पावनखिंडीतील लढाई";
        t17 = "पुरंदराचा तह";
        t18 = "मोगल साम्राज्याशी संघर्ष";
        t19 = "शाहिस्तेखान प्रकरण";
        t20 = "सुरतेची पहिली लूट";
        t21 = "मिर्झाराजे जयसिंह प्रकरण";
        t22 = "आग्य्राहून सुटका";
        t23 = "सर्वत्र विजयी घोडदौड";
        t24 = "राज्याभिषेक";
        t26 = "शिवाजी जयंती";
        t27 = "शिवाजीमहाराजांविषयी ललितेतर लेखन";
        t29 = "शिवाजीची स्तुती करणारे अभारतीय";
        t30 = "शिवाजीवर टीका करणारे लेखक, राजकारणी आणि पुस्तके";
        t31 = "पूर्वज";


        p1 = "पुणे जिल्ह्यातील जुन्नर शहरानजीक वसलेल्या शिवनेरी या डोंगरी किल्ल्यावर इ.स. १६३० मध्ये छत्रपती शिवाजी महाराज यांचा जन्म झाला. इतिहासाच्या अभ्यासकांमध्ये शिवाजीची नेमकी जन्मतारीख हा एकेकाळी मतभेदांचा मुद्दा होता. तो वाद नंतर मिटला. महाराष्ट्र राज्य शासनाने फाल्गुन वद्य तृतीया शके १५५१ (शुक्रवार. १९ फेब्रुवारी १६३०) ही शिवरायांची जन्मतारीख २००१ साली स्वीकारली.[१] त्याप्रमाणे महाराष्ट्र सरकार दरवर्षी १९ फेब्रुवारी या दिवशी सुटी जाहीर करते. इतर संभाव्य तारखांमध्ये ६ एप्रिल १६२७((वैशाख शुद्ध तृतीया) ही एक जन्मतारीख मानली जात होती. त्यानुसार, महाराष्ट्राबाहेरचे अनेक लोक शिवजयंतीचा दिवस म्हणून वैशाख शुद्ध तृतीया हा दिवस, आणि महाराष्ट्रातले काही लोक मराठी पंचांगाप्रमाणे फाल्गुन वद्य तृतीया हा दिवस शिवजयंती म्हणून पाळतात. त्याप्रमाणे विविध कॅलेडरांत वेगवेगळी तारीख दाखविली असते.\n" +
                "एका आख्यायिकेनुसार शिवनेरी गडावरील शिवाई देवीला जिजाबाईंनी आपल्याला बलवान पुत्र व्हावा अशी प्रार्थना केली होती म्हणून या मुलाचे नाव 'शिवाजी' ठेवले गेले.";

        p2 = "वडिल\n" +
                "शहाजीराजे\n" +
                "शहाजीराजे प्रथम अहमदनगरच्या निजामशहाच्या पदरी एक सरदार म्हणून होते. मलिक अंबर ह्या निजामशहाच्या प्रभावी वजिराच्या मृत्यूनंतर मोगल सम्राट शहाजहानच्या सैन्याने इ.स. १६३६ मधे अहमदनगरवर चाल करून ते शहर आपल्या ताब्यात घेतल्यानंतर शहाजीराजे विजापूरच्या आदिलशहाच्या पदरी सरदार म्हणून रूजू झाले. आदिलशहाने त्यांना पुण्याची जहागिरी दिली. शहाजीराजांनी तुकाबाईंशी आपला दुसरा विवाह केला. लहान शिवाजीराजांना घेऊन जिजाबाई पुण्याला रहायला आल्या. तुकाबाई आणि शहाजीराजे ह्यांच्या एकोजी भोसले (व्यंकोजी भोसले) ह्या पुत्रांनी पुढे सध्याच्या तमिळनाडूमधील तंजावरला आपले राज्य स्थापन केले.\n" +
                "\n" +
                "आई\n" +
                "जिजाबाई\n" +
                "\n" +
                "जिजाबाई व बाल शिवाजी\n" +
                "जिजाबाई पुण्यात रहायला गेल्या त्यावेळी पुण्याची फार दुरवस्था झालेली होती. तेव्हा छोटे शिवाजीराजे आणि कारभारी ह्यांच्या हस्ते पुण्यात एका शेतात प्रतीकादाखल सोन्याच्या मुलाम्याचा नांगर फिरवून, जिजाबाईंनी दादोजी कोंडदेवांच्या मदतीने पुण्याची पुन:स्थापना करायला सुरुवात केली. शिवाजीराजे लहानाचे मोठे होत असताना आणि मोठे झाल्यावरही (मोठेपणीच्या सिंहगडावरच्या स्वारीसारख्या) प्रत्येक महत्त्वाच्या प्रसंगी त्यांना जिजाबाईंनी खंबीर मार्गदर्शन दिले. शिवाजीमहाराजांच्या त्या आद्यगुरू होत. हिंदवी स्वराज्यस्थापनेचे स्वप्न साकार करायला शिवाजीमहाराजांना जिजाबाईंनी स्फूर्ति दिली असे काही इतिहासकार मानतात.\n" +
                "\n" +
                "पत्नी\n" +
                "सईबाई निंबाळकर\n" +
                "सोयराबाई मॊहिते\n" +
                "पुतळाबाई पालकर\n" +
                "लक्ष्मीबाई विचारे\n" +
                "काशीबाई जाधव\n" +
                "सगणाबाई शिंदे\n" +
                "गुणवंतीबाई इंगळे\n" +
                "सकवारबाई गायकवाड\n" +
                "वंशज\n" +
                "मुलगे\n" +
                "छत्रपती संभाजी भोसले\n" +
                "छत्रपती राजारामराजे भोसले\n" +
                "मुली\n" +
                "अंबिकाबाई महाडीक\n" +
                "कमळाबाई (सकवारबाईची कन्या)\n" +
                "दीपाबाई\n" +
                "राजकुंवरबाई शिर्के (सगुणाबाईची मुलगी, गणोजी शिर्के यांची पत्नी)\n" +
                "राणूबाई पाटकर\n" +
                "सखुबाई निंबाळकर (सईबाईची मुलगी)\n" +
                "सुना\n" +
                "संभाजीच्या पत्नी येसूबाई\n" +
                "राजारामांच्या पत्नी ताराबाई (माहेरच्या मोहिते)\n" +
                "जानकीबाई\n" +
                "राजसबाई (पुत्र संभाजी - १६९८-१७६०)\n" +
                "अंबिकाबाई (सती गेली)\n" +
                "सगुणाबाई\n" +
                "नातवंडे\n" +
                "संभाजीचा मुलगा - शाहू\n" +
                "ताराबाईची राजारामाची मुले - दुसरा शिवाजी\n" +
                "राजसबाईची मुले - दुसरा संभाजी\n" +
                "पतवंडे\n" +
                "ताराबाईचा नातू रामराजा, याला शाहूने दत्तक घेतले, म्हणजे तो स्वतःचाच काका झाला.\n" +
                "दुसऱ्या संभाजीचा मुलगा - द्वितीय शिवाजी (खरेतर ३रा शिवाजी) (कोल्हापूर)";


        p3 = "लोककथा आणि इतिहास ह्यांमधे कालौघात पुष्कळदा सरमिसळ होते, आणि त्यामुळे इतिहासाचा नेमका मागोवा घेणे कठीण होते. शिवाजीमहाराजांच्या बाबतीत ती सरमिसळ खूपच आहे; परिणामी शिवाजीराजांना कोणाचे मार्गदर्शन किती मिळाले हे नक्की ठरवणे निदान आज तरी कठीण आहे. युद्धाभ्यास आणि रणनीती तसेच राजकारभार ह्यांसबंधी प्राथमिक मार्गदर्शन त्यांना शहाजीराजांकडून, दप्तरव्यवस्था व न्यायव्यवस्थेचे शिक्षण दादोजी कोंडदेव मलठणकर यांजकडून, तर परकीय सत्तेविरूद्ध लढा करण्याकरता आवश्यक असलेल्या शिस्तीचे शिक्षण जिजाबाईंकडून मिळाले असे मात्र उपलब्ध ऐतिहासिक माहितीवरून निश्चितपणे सांगता येते.\n" +
                "\n" +
                "जिजाबाई यांनी बाल शिवाजीच्या शिक्षणाची जबाबदारी घेऊन त्यांस युद्धकला व राजनीतिशास्त्राचे शिक्षण देवविले शिवाय संत एकनाथ महाराजांच्या भावार्थ रामायण, भारूड इत्यादींच्या माध्यमातून बाल शिवबाच्या मनात स्वराज्याचे स्फुल्लिंग चेतविले. पालक व स्वराज्याच्या प्राथमिक संत तुकाराममहाराज ह्यांचे महत्त्वाचे मार्गदर्शनही शिवाजीराजांना लाभले होते";

        p4 = "नेताजी पालकर\n" +
                "प्रतापराव गुजर\n" +
                "हंबीरराव मोहिते\n" +
                "खंडेराव कदम";

        p7 = "इ.स. १६४७ मधे सतरा वर्षांच्या शिवाजीराजांनी आदिलशहाच्या ताब्यातला तोरणगड जिंकला आणि स्वराज्याची मुहूर्तमेढ रोवली. तोरणगड हे स्वराज्याचे तोरणच ठरले. त्याच साली शिवाजीराजांनी कोंढाणा(सिंहगड), आणि पुरंदर हे किल्ले आदिलशहाकडून जिंकून पुणे प्रांतावर पूर्ण नियंत्रण मिळवले.या शिवाय तोरणगडासमोरील मुरुंबदेवाचा डोंगर जिंकून त्याची डागडुजी केली व त्याचे नाव त्यांनी राजगड असे ठेवले.";

        p8 = "शिवाजीराजांच्या यशस्वी स्वार्\u200Dयां बिथरून शिवाजीराजांना आळा घालण्याची एक युक्ती म्हणून आदिलशहाने शहाजीराजांना अटक केली. शिवाय सुमारे ५००० फौज घेऊन फत्तेखान नावाच्या सरदाराला शिवाजीराजांवर हल्ला करण्यास पाठवले. शिवाजीराजांनी पुरंदरावर फत्तेखानाचा पराभव केला. बाजी पासलकर सैन्यासकट पळत्या फत्तेखानाच्या पाठलागावर सासवडपर्य़ंत गेले. सासवडजवळ झालेल्या लढाईत बाजी पासलकरांचा मॄत्यू झाला.\n" +
                "\n" +
                "शिवाजीराजांनी मोगल बादशाह शाहजहान यास त्याच्या दख्खनच्या सुभेदाराकरवी (शहजादा मुरादबक्ष) पत्र पाठवून शहाजीराजांसकट त्याच्या चाकरीत जायची इच्छा प्रकट केली. त्याचा परिणाम म्हणून शाहजहानाने आदिलशहावर दबाव आणला आणि परिणामी शहाजीराजांची सुटका झाली. परंतु त्यासाठी शिवाजीराजांना कोंढाणा किल्ला, आणि शहाजीराजांना बंगळूर शहर आणि कंदर्पीचा किल्ला आदिलशहाला द्यावा लागला.";

        p9 = "आदिलशहाशी इमान राखणारा जावळीचा सरदार चंद्रराव मोरे शहाजीराजे आणि शिवाजीराजे यांच्याविरूद्ध आदिलशहाकडे कुरापती काढत असे. त्याला धडा शिकविण्यासाठी इ.स. १६५६ साली शिवाजीने रायरीचा किल्ला सर केला. त्यामुळे कोकण भागात स्वराज्याचा विस्तार झाला.";

        p12 = "आदिलशहाच्या ताब्यात असणारे किल्ले जिंकत राहिल्यामुळे इ.स. १६५९ साली आदिलशहाने दरबारात शिवाजी महाराजांना संपविण्याचा विडा ठेवला. हा विडा दरबारी असलेल्या अफझलखान नावाच्या सरदाराने उचलला. मोठ्या सैन्यासह आणि लवाजम्यासह अफझलखान मोहिमेवर निघाला. अफझलखान वाईजवळ आला तेव्हा शिवाजीराजांनी सध्याच्या महाबळेश्वर जवळ असलेल्या प्रतापगडावरून त्यास तोंड देण्याचे ठरवले. तहाची बोलणी सुरू झाली आणि अंतिम बोलणीसाठी शिवाजी महाराजांनी स्वतः यावे असा अफझलखानचा आग्रह होता. पण शिवाजीराजांच्या वकिलांनी (पंताजी गोपीनाथ बोकील यांनी) अफझलखानाला गळ घालून प्रतापगडावरच भेट घेण्यास बोलावले. भेटीच्या नियमांनुसार दोन्ही पक्षांकडील मोजकीच माणसे भेटीसाठी येतील आणि दरम्यान सर्वांनी नि:शस्त्र राहण्याचे ठरले.\n" +
                "\n" +
                "शिवाजीराजांना अफझलखानच्या दगाबाजपणाची कल्पना असल्यामुळे त्यांनी सावधगिरी म्हणून चिलखत चढविले आणि सोबत बिचवा तसेच वाघनखे ठेवली. बिचवा चिलखतामध्ये दडविला होता तर वाघनखे हाताच्या पंजाच्या आतमध्ये वळविलेली असल्यामुळे दिसणारी नव्हती. शिवाजी महाराजांसोबत जिवा महाला हा विश्वासू सरदार होता तर अफझलखानसोबत सय्यद बंडा हा तत्कालीन प्रख्यात असा दांडपट्टेबाज होता. प्रतापगडावरील एका छावणीमध्ये भेट ठरली. भेटीच्या वेळी उंचपुर्\u200Dया, बलदंड अफझलखानाने शिवाजी महाराजांना मिठी मारली आणि शिवाजीराजांचे प्राण कंठाशी आले. त्याच वेळी अफझलखानने कट्यारीचा वार शिवाजी महाराजांवर केला परंतु चिलखतामुळे शिवाजीराजे बचावले. अफझलखानाचा दगा पाहून शिवाजीराजांनी वाघनखे खानाच्या पोटात घुसवली. त्याचबरोबर अफझलखानाची प्राणांतिक आरोळी चहूकडे पसरली. सय्यद बंडाने तत्क्षणी शिवाजीवर दांडपट्ट्याचा जोरदार वार केला जो तत्पर जिवा महालाने स्वतःवर झेलला आणि शिवाजीराजांचे प्राण वाचले. यामुळेच \"होता जिवा म्हणून वाचला शिवा\" ही म्हण प्रचलित झाली.\n" +
                "\n" +
                "आधीच ठरलेल्या इशार्\u200Dयाप्रमाणे भेटीच्या वेळी तीन तोफांचे बार प्रतापगडावरून काढण्यात आले, आणि खानाच्या छावणीच्या जवळपासच्या झाडाझुडुपांमध्ये दडून बसलेल्या मावळ्यांनी हल्ला करून खानाच्या सैन्याची दाणादाण उडविली. खानाचा मुलगा फाजलखान आणि इतर काही सरदार लपूनछपून वाईच्या मुख्य छावणीपर्यंत आले. इथे खानाचा जनाना होता. ते पाठलागावर असलेल्या नेताजीच्या सैन्यापासून वाचण्यासाठी खजिना, हत्ती व इतर जड सामान टाकून विजापूरला जनान्यासकट पळाले.\n" +
                "शिवाजीराजांना जनतेत मिळालेला आदर आणि प्रेम अनेक शतकांनंतरही टिकून आहे त्यामागचे त्यांची सहिष्णू वृत्ती हे फार महत्त्वाचे कारण आहे. अफझलखानाच्या मृत्यूनंतर त्यांनी त्याच्या शवाचे अंत्यसंस्कार इस्लामी पद्धतीने करून त्याची एक कबर प्रतापगडावर बांधली आणि त्या कबरीच्या कायम देखभालीची व्यवस्था केली.\n" +
                "\n" +
                "अफझलखानच्या मृत्यूनंतर शिवाजीराजांनी दोरोजी नावाच्या सरदाराला कोकणपट्ट्यातील आणखी किल्ले आणि प्रदेश जिंकण्यास पाठवले. स्वतः राजे सातारा प्रांतात घुसून कोल्हापुरापर्यंत गेले व त्यांनी पन्हाळा जिंकून घेतला. नेताजीने त्याच्या सैन्यासह जवळपास विजापुरापर्यंत धडक मारली.";


        p13 = "प्रतापगडाची लढाई ही महाराष्ट्राच्या इतिहासातील एक महत्वाची लढाई आहे. प्रतापगडाची लढाई ही महाराष्ट्राच्या इतिहासातील सर्वात रोमांचक क्षण मानला जातो. शिवाजी महाराजांनी अफजलखानाच्या रुपात आलेले स्वराज्यावरील संकट अफजलखानाचा वध करून तसेच त्याच्या सैन्याचा दणदणीत पराभव करून परतवून लावले.\n\n शिवाजींनी पुण्याजवळील मावळ प्रातांत नियंत्रण मिळवले होते. त्या वेळेस हा भाग अदिलशाहीच्या अखत्यारीत येत होता त्यामुळे त्यांच्या दृष्टीने शिवाजीचा बंदोबस्त करणे आवश्यक होते. विजापूरच्या दरबारात शिवाजींचा बंदोबस्त करण्याची मोहिम अफजलखानाकडे देण्यात आली. अफजलखानाने यापूर्वी शिवाजींचे थोरले बंधु संभाजी यांची हत्या केली होती तसेच आदिलशाही दरबारात त्याचे व शिवाजींचे वडील शहाजी यांचेही वैर होते. अफजलखान मोठा फौजफाटा घेउन विजापूरहून जून १६५९ मध्ये निघाला. वाटेत येताना इस्लामच्या प्रथे प्रमाणे तो देवळे पाडत व मुर्तीभंजन करत आला. शिवाजींनी खान येत आहे सुद्धा बातमी ऐकल्यावर आपला मुक्काम राजगडावरून घनदाट जंगलातील आणखी दुर्गम असलेल्या प्रतापगड येथे हलवला. अफजलखानाने तुळजापूर च्या भवानी मंदीराचा उध्वंस केला व आपली नजर पंढरपूर च्या विठ्ठ्ल मंदीरावर वळवली. खानाचा असा अंदाज होता की मंदीरे अश्या प्रकारे उधव्स्त केली तर शिवाजी चिडून उघड्यावर येउन युद्ध करतील परंतु शिवाजी महाराजांनी अजूनच बचावाचा पावित्रा घेतला. खानाने आपला मुक्काम वाई येथे टाकला. तो पूर्वी वाईचा सुभेदार असल्याने त्याला त्या भागाची चांगली माहिती होती.\n\nअफजलखानाच्य सैन्यात अनेक स्रदारांचा समावेश होता. त्यातील काही प्रमुख सय्यद बंडा, फाजलखान, अंबरखान, याकुतखान, सिद्दी हिलाल, मुसाखान तसेच काही मराठे सरदार पिलाजी मोहिते, प्रतापराव मोरे इत्यादी जे आदिलशाहीत चाकरीला होते. त्याच्या फौजेत १२,००० च्या घोडदळाचा समावेश होता तसेच १०,००० पायदळ तसेच १,५०० बंदूकधारी सैनिक, ८५ हत्ती व १,२०० ऊंटांचा समावेश होता. तसेच ८० ते ९० तोफा होत्या. अफजलखानाने जंजिर्\u200Dयाच्या सिद्दीशी हातमि़ळ्वणी करून कोकणच्या बाजूनेही आपले पाश आवळले.\n\nशिवाजींनी आपले दूत पाठवून खानाला आपण घाबरलो असल्याचे दाखवले व आपल्याला खानाशी युद्ध करायचे नाही व समझोत्यास तयार आहोत हे कळवले. खानाने प्रथम वाईस बोलवणे धाडले, पण शिवाजींनी नकार दिला. दोन्ही बाजूंकडून घातपाताची शक्यता होती. परंतु शिवाजींनी आपण खूपच घाबरलो असल्याचे खानाला दाखवले व खान प्रतापगडाच्या पायथ्याशी भेटायला तयार झाला. भेटी दरम्यान दोन्ही पक्ष कोणतेही हत्यार वापरणार नाही असे ठरले. प्रत्येक पक्षाचे १० अंगरक्षक असतील व त्यातील एकजण शामियान्या बाहेर थांबेल. व इतर अंगरक्षक दूर रहातील असे ठरले. भेटीची वेळ नोव्हेंबर १० इ.स. १६५९ रोजी ठरली.\n" +
                "\n" +
                "भेटीच्या दिवशी अफजलखान भेटीच्या वेळेआधीच शामियान्यात आला. शिवाजींनी जाणून बूजून अतिशय भव्य शामियाना बनवला होता. निःशस्त्र भेटायचे ठरले असले तरी खानाने आपल्या अंगरख्याखाली बिचवा लपवला होता व खानाकडून घातपाताची शक्यता शिवाजींनी १०० टक्के धरली होती त्यामुळे त्यांनी अंगरख्या खाली चिलखत चढवले होते व लपवण्यास अतिशय सोपी वाघनखे हातामध्ये लपवली होती. भेटीच्या सुरुवातीसच खानाने शिवाजींना अलिंगन देण्यास बोलवले व उंच अफजलखानाने शिवाजींना आपल्या काखेत दाबून बिचव्याचा वार केला. परंतु चिलखत असल्याने शिवाजी महाराज बचावले. खानाने दगा केलेला पाहून शिवाजींनी लपवलेली वाघनखे काढली व खानाच्या पोटात घुसवून त्याची आतडी बाहेर काढली. अनपेक्षित प्रतिवाराने भेदरलेल्या खानाने दगा दगा असा आक्रोश केला व इतर अंगरक्षकांना सावध केले. इतर अंगरक्षकांच्यात तिथेच जुंपली. सय्यद बंडाने शिवाजींवर वार केला परंतु तो जिवा महालाने आपल्यावर घेतला व शिवाजींचा रस्ता मोकळा केला. इकडे खान त्याच्या पालखीत स्वार झाला परंतु संभाजी कावजीने प्रथम पालखी वाहणार्\u200Dया भोईंचे पाय तोडले व जखमी अफजलखानाला मारून त्याचे शीर धडापासून अलग केले. शिवाजींनी हे शीर नंतर आपल्या मातोश्रींना भेटीदाखल पाठवले. शिवाजींनी झपाट्याने किल्यावर प्रयाण केले व तोफांनी आपल्या सैन्याला अफजलखानाच्या सैन्यावर आक्रमण करायचे आदेश दिले.\n" +
                "\n" +
                "\n" +
                "प्रतापगड\n" +
                "लढाई[संपादन]\n" +
                "मराठे सैनिकांच्या तुकड्या प्रतापगडाच्या जंगलात दबा धरून बसल्या होत्या. तोफा धडाडताच त्यांनी अफजलखानाच्या सैन्यावर झपाट्याने काही कळायच्या आत आक्रमण केले. कान्होजी जेधे याने बंदूकधार्\u200Dयांवर आक्रमण केले. दुसर्\u200Dया एका कमानीच्या हल्यात मुसाखान जखमी झाला व पळून गेला. अफजलखानाच्य सैन्याची वाताहत झाली. नेताजी पालकर यांच्या नेतृत्वाखाली घोडदळाने अफजलखानाच्या वाईच्या तळावर अचानकपणे हल्ला चढवला व तेथेही त्यांची वाताहत केली.\n\nआदिलशाही सेनेसाठी हा जबरदस्त पराभव होता. अफजलखानाचा वध ही संपूर्ण आदिलशाहीसाठी मोठी घटना होती. जवळपास ५,००० सैनिक मारले गेले व तितकेच जखमी झाले. जवळपास ३,००० सैनिक युद्धबंदी बनवण्यात आले. मराठ्यांचे पण त्यांच्या सैनिकक्षमतेच्या दृष्टीने थोडेफार नुकसान झाले. शिवाजींनी विरोधी सैन्यातील बंदीवानांना योग्य तो मान दिला. जखमींची योग्य ती शुश्रुषा केली गेली. कोणत्याही बंदीवान स्त्री अथवा पुरुषांवर अत्याचार झाले नाहीत. बऱ्याच जणांना परत विजापूरला पाठवण्यात आले.\n" +
                "\n" +
                "पुढील १५ दिवसात शिवाजी महाराजांनी सातारा, कोल्हापूर व कोकणात किल्ले काबीज करायचा धडाका लावला व त्यात त्यांना नेत्रदीपक यश मिळाले. कोल्हापूर जवळील पन्हाळा किल्यापर्यंत त्यांनी मजल मारली. या घटनेनंतर शिवाजी महाराजांची एक कुशल नेता म्हणून ओळख प्राप्त झाली. अफजलखानासारख्या बलाढ्य सेनापतीचा पार धुव्वा उडवल्यामुळे शिवाजींचा भारतभर लष्करी दरारा वाढला.";


        p14 = "शिवाजी महाराजांनी अफजलखानाचा नोव्हेंबर १० १६५९ रोजी वध करून त्याच्या सेनेचा प्रचंड धुव्वा उडवला व काही दिवसातच अतिशय आक्रामक भूमिका घेउन अनेक किल्ले आपल्या अखत्यारीत घेतले. डिसेंबर १६५९ मध्ये शिवाजी महाराज कोल्हापूर नजीक पन्हाळ्यानजीक पोहोचले व याच सुमारास अदिलशाही सरदार रुस्तमजमान मिरजेपाशी पोहोचला.\n\nरुस्तमजमान कडे अनेक मातब्बर सरदार होते फ़ाजलखान, मलिक इत्बार, सादतखान, याकुबखान, हासन खान, संताजी घाटगे इत्यादी व त्याचे सैन्यबळही मोठे होते. शिवाजी महाराजांच्या सेनेत नेताजी पालकर , हणमंतराव खराटे, हिरोजी इंगले, भिमाजी वाघ इत्यादी सरदार होते.\n" +
                "\n" +
                "शिवाजी महाराज पन्हाळ्यावर आहेत असे कळाल्यानंतर पन्हाळ्यावर आक्रमणकरण्याच्या बेतात रुस्तमजमान होता. परंतु २८ डिसेंबरला पहाटेच अचानकपणे शिवाजी महाराजांनी रुस्तमजमानच्या सेनेवर जोरदार हल्ला चढवला. पुर्ण जोरदार हल्ला न चढवता पुढून मागून आजूबाजूने तुकड्यांनी हल्ले चढवले व आदिलशाही सेनेला नामोहरम केले. रुस्तमजमान रणांगण सोडून पळून गेला.\n" +
                "\n";

        p15 = "अफझलखानच्या मृत्यूमुळे चिडलेल्या आदिलशहाने त्याचा सेनापती सिद्दी जौहर यास सर्व शक्तीनिशी हल्ला करण्याचा आदेश दिला. इ.स. १६६० साली झालेले हे आक्रमण स्वराज्यावरील अनेक मोठ्या संकटांपैकी एक समजले जाते. त्यासुमारास शिवाजीराजे मिरजेच्या किल्ल्याला वेढा घालून होते. सिद्दीच्या आक्रमणाची बातमी येताच राजे पन्हाळगडावर गेले आणि सिद्दी जौहरला त्याचा सुगावा लागताच त्याने गडालाच वेढा घातला आणि गडाची रसद तोडली. काही दिवस गडावरील सर्वांनी तग धरली पण सिद्दीचा वेढा उठण्याचे काही लक्षण दिसेना तेव्हा सर्वांशी खलबत करून शिवाजीराजांनी जवळच्या विशालगडावर पोहोचावे असा निर्णय घेतला. पन्हाळगडावरून एके रात्री शिवाजीराजे आणि काही मंडळी गुप्त रस्त्याने शिताफीने निसटले. ह्याचा पत्ता लागताच सिद्दी जौहरने सिद्दी मसऊदच्या बरोबर काही सैन्य पाठलागावर रवाना केले.\n" +
                "\n";
        p16 = "पन्हाळगडापासून काही अंतरावर वाटेत सिद्दीच्या सैन्याने त्यांना घोडखिंडीत गाठले आणि हातघाईची लढाई सुरू झाली. तेव्हा शिवाजीराजांचे विश्वासू पराक्रमी सरदार बाजी प्रभु देशपांडे यांनी शिवाजीराजांना विनंती केली की त्यांनी विशालगडासाठी पुढे कूच करावी आणि खिंडीतील लढाई स्वतः लढतील. विशालगडावर पोहोचताच तोफांच्या तीन डागण्या ऐकू आल्या म्हणजे शिवाजीराजे सुखरूप गडावर पोहचले असा संदेश मिळेल. बाजी प्रभु देशपांड्यांनी वचन दिले की जो पर्यंत तोफांचे तीन आवाज ऐकू येणार नाहीत तो पर्यंत सिद्दी जौहरला खिंडीमद्ध्येच झुंजवत ठेवतील.\n" +
                "\n" +
                "शिवाजीराजांना ते पटेना पण 'बाजी'च्या विनंतीवजा हट्टापुढे त्यांनी यास मान्यता दिली आणि विशालगडासाठी कूच केले. बाजींनी सिद्दीच्या सैन्याला रोखून धरण्यासाठी प्रयत्नांची शर्थ केली, पण संख्येने कितीतरी पटीने अधिक सैन्यापुढे बाजीप्रभूंनी प्राणांची बाजी लावली. ते स्वतः प्राणांतिक रितीने घायाळ झाले होते. शेवटी सैनिकांनी मृत्युपथावर असलेल्या घायाळ बाजींना एके ठिकाणी आणून बसविले, पण बाजींचे प्राण कानाशी साठले होते. थोड्या वेळाने तोफांचे तीन आवाज ऐकू आले आणि शिवाजीराजे गडावर पोहोचल्याचा तो संदेश समजल्यावरच बाजी प्रभु देशपांडे यांनी प्राण सोडले.\n" +
                "\n" +
                "शिवाजीराजांना ही बातमी फार चटका लावून गेली. बाजीप्रभू हे ज्या घोडखिंडीत लढले आणि स्वतःच्या प्राणांचे बलिदान दिले त्या घोडखिंडीचे नाव शिवरायांनी पावनखिंड असे बदलले. बाजीप्रभूच्या बलिदानाने पावन झालेली ती पावनखिंड.";

        p17 = "इ.स. १६४९ मध्ये आदिलशहाने शहाजीराजांना कैदेत टाकले. याच वेळी शिवाजी महाराजांनी अनेक आदिलशाही किल्ले आपल्या ताब्यात घेतले. म्हणून शिवाजीचा बंदोबस्त करण्यासाठी आदिलशहाने फत्तेखानास रवाना केले. शिवाजीमहाराजांसाठी परिस्थिती फारच बिकट होती. एकीकडे वडील शहाजीराजे कैदेत होते तर दुसरीकडे फत्तेखानाच्या स्वारीमुळे स्वराज्य धोक्यात येणार होते. महाराजांनी यावेळी लढाईसाठी पुरंदर किल्ल्याची जागा निवडली. मात्र यावेळी गड मराठ्यांच्या ताब्यात नव्हता. महादजी निळकंठराव यांच्या ताब्यात किल्ला होता. त्यांच्या भावभावांमधील भांडणाचा फायदा उठवून महाराजांनी किल्ल्यात प्रवेश करण्यात यश मिळवले. या पुरंदर किल्ल्याच्या आश्रयाने मराठ्यांनी फत्तेखानाशी झुंज दिली आणि लढाई जिंकली. शिवाजी महाराजांना या पहिल्या लढाईतच मोठे यश प्राप्त झाले. सन १६५५ मध्ये शिवाजीराजांनी नेताजी पालकर यास गडाचा सरनौबत नेमले. वैशाख शु. १२ शके १५७९ म्हणजेच १४ मे १६५७ गुरुवार या दिवशी संभाजी राजांचा जन्म पुरंदरावर झाला.\n" +
                "\n" +
                "शके १५८७ म्हणजेच १६६५ मध्ये मोगल सरदार जयसिंगाने पुरंदर किल्ल्याला वेढा घातला.\n" +
                "खानाने वज्रगड ताब्यात घेतला आणि पुरंदरावर हल्ला करून पुरंदर माचीचा ताबा घेतला. माचीवर खानाचे आणि मुरारबाजीचे घनघोर युद्ध झाले. मुरारबाजी पडला आणि त्याच बरोबर पुरंदरही पडला. हे वर्तमान जेव्हा राजांना कळले तेव्हा त्यांनी जयसिंगाशी तहाचे बोलणे सुरू केले आणि ११ जून १६६५ साली इतिहास प्रसिद्ध 'पुरंदरचा तह' झाला.\n" +
                "\n" +
                "या तहान्वये महाराजांनी आग्राला भेट देण्याचे तसेच दक्षिणेकडील मुघलांना मदत करण्याचे मान्य केले व चार लाख होणचा प्रदेश व २३ किल्ले राजांना मोगलांना द्यावे लागले. त्यांची नावे अशी,\n" +
                "\n" +
                "\n" +
                "१. अंकोला\n" +
                "२. कर्नाळा\n" +
                "३. कोंढाणा (सिंहगड)\n" +
                "४ कोहोज\n" +
                "५. खिरदुर्ग (सागरगड)\n" +
                "६. तिकोना\n" +
                "७. तुंग\n" +
                "८. नंगगड\n" +
                "९. नरदुर्ग\n" +
                "१०. पळसगड\n" +
                "११. किल्ले पुरंदर\n" +
                "१२. प्रबळगड - मुरंजन\n" +
                "१३. भंडारगड\n" +
                "१४. मनरंजन\n" +
                "१५. मानगड\n" +
                "१६. मार्गगड\n" +
                "१७. माहुलीगड\n" +
                "१८. रुद्रमाळ\n" +
                "१९. रोहिडा\n" +
                "२०. लोहगड\n" +
                "२१. वसंतगड\n" +
                "२२. विसापूर\n" +
                "२३. सोनगड";

        p18 = "मोगल सत्तेशी संघर्ष हा शिवचरित्राचा व्यापक आणि अविभाज्य भाग आहे. तत्कालीन मोगल साम्राज्य हे भारतातील सर्वांत बलाढ्य होते आणि औरंगजेब हा अतिशय कठोर आणि कडवा मोगल बादशहा दिल्ली येथे शासन करीत होता.";

        p19 = "मोगल साम्राज्याचा नर्मदा नदीपलीकडे विस्तार, तसेच शिवाजी महाराजांच्या राज्यविस्ताराला वेसण घालणे या दोन हेतूंसाठी औरंगजेबाने त्याचा मामा शाहिस्तेखान याला दख्खनच्या मोहिमेवर पाठविले. प्रचंड मोठा लवाजमा, सैन्य आणि फौजफाटा सोबत घेऊन शाहिस्तेखान निघाला आणि वाटेत असणार्\u200Dया प्रत्येक राज्यात, गावात त्याने दहशत पसरवीत जमेल तेवढा जमेल तेथे विध्वंस केला. शेवटी पुण्याजवळील चाकणचा किल्ला जिंकून पुण्यातील शिवाजीराजांच्या लाल महालातच तळ ठोकला. शिवाजीराजांनी खानाचा बंदोबस्त करण्यासाठी एक धाडसी निर्णय घेतला तो म्हणजे लाल महालात शिरून खानाला संपविण्याचा. लाल महालात आणि अवतीभोवती खडा पहारा असे आणि महालात शिरणे अतिशय जोखमीचे काम होते.\n" +
                "\n" +
                "एके रात्री लाल महालाजवळून जाणार्\u200Dया एका लग्नाच्या मिरवणुकीचा आधार घेऊन काही मोजक्या माणसांसह स्वतः शिवाजी महाराज लाल महालात शिरले. महालाचा कानाकोपरा माहीत असल्यामुळे लवकरच प्रत्यक्ष शाहिस्तेखानच्या खोलीत शिवाजी महाराजांनी प्रवेश केला. तोपर्यंत महालात कोठेतरी झटापट सुरू झाल्यामुळे शाहिस्तेखानला जाग आली आणि तेवढ्यातच शिवाजीराजांना समोर पाहून खानाने जीव वाचविण्यासाठी सरळ खिडकीतून खाली उडी घेतली. शिवाजी महाराजांनी चपळाईने केलेला वार हुकल्यामुळे खानाच्या प्राणावर बेतण्याऐवजी त्याची तीन बोटे कापली गेली. या प्रकरणामुळे मोगल साम्राज्याची जी नाचक्की झाली ती स्वराज्यासाठी अधिकच फायद्याची ठरली. जे राजे मोगलांच्या आश्रयामुळे शिवाजी महाराजांना जुमानत नसत ते आता शिवाजीराजांच्या पराक्रमामुळे त्यांच्या बाजूने झुकले. आणखी एक वेगळा परिणाम या प्रकरणामुळे झाला, तो म्हणजे शिवाजीराजांना मिळालेला मानवी क्षमतेपेक्षा मोठा दर्जा आणि त्यामुळे जोडलेल्या दंतकथा.\n" +
                "\n" +
                "अनेकदा या गोष्टीचा अप्रत्यक्ष फायदा शिवाजी महाराज किंवा त्यांच्या सैन्याला मिळाला. शत्रू सैन्यामध्ये शिवाजी महाराज घुसल्याच्या केवळ अफवा पसरवून संख्येने किरकोळ असलेल्या मावळ्यांनी संख्येने अनेक पटींनी मोठ्या सैन्याची उडविलेली दाणादाण ही याच गोष्टीची साक्ष देऊ शकते. इ.स. १६६३ सालचे शाहिस्तेखान प्रकरण शिवाजीराजांच्या जीवनात आणखी एका नाट्यमय प्रसंगाची भर घालून गेले.";
        p20 = "इ.स. १६६४. सततची युद्धे आणि त्यामुळे रिता होत असलेला खजिना यामुळे शिवाजीराजे चिंतेत असत. मोगलांना किंवा इतर सुलतानांना ही चिंता फार सतावीत नसे. अन्याय्य कर लादून किंवा बळजबरीने खंडणी जनतेकडून वसूल करण्यात बादशाही कारभारास कमीपणा वाटत नव्हता. अनेक दिवसांच्या खलबतांनंतर शिवाजीराजांनी शेवटी एक उपाय शोधून काढला तो म्हणजे इतिहासाला माहीत असलेली सुरतेची पहिली लूट. आजच्या गुजरात राज्यातील सुरत शहर हे तत्कालीन मोगल राज्यात होते आणि व्यापारामुळे अतिशय श्रीमंत शहरांमध्ये गणले जात होते. सुरत शहराच्या लुटीमुळे दोन गोष्टी साध्य करता आल्या, एक म्हणजे मोगल सत्तेला आव्हान आणि राज्याच्या खजिन्यात भर.\n" +
                "\n" +
                "लुटीचा इतिहास भारतामध्ये अतिशय रक्तरंजित आणि विनाशक आहे. त्या पार्श्वभूमीवर सुरतेची लूट ही पूर्णपणे वेगळी जाणवते. शिवाजीराजांच्या आज्ञेनुसार स्त्रिया, मुले आणि वृद्ध यांच्या केसालाही धक्का न लावता ही लूट केली गेली. मशिदी, चर्च यासारख्या देवस्थानांनाही लुटीतून संरक्षण दिले गेले.";
        p21 = "इ.स. १६६५. औरंगजेबाने त्यांचे पराक्रमी सेनापती मिर्झाराजे जयसिंह याला प्रचंड सैन्यासह पाठविले. शिवाजीराजांचा प्रतिकार थिटा पडला आणि निर्णायक लढाईनंतर पुरंदरचा तह झाला आणि शिवाजीराजांना तहाच्या अटींनुसार २३ किल्ले द्यावे लागले. त्याबरोबरच स्वतः आग्रा (तत्कालीन मोगल राजधानी) येथे पुत्र संभाजी यासह औरंगजेबासमोर हजर होण्याचे कबूल करावे लागले.";

        p22 = "इ.स. १६६६ साली औरंगजेबाने शिवाजीराजांना दिल्ली येथे भेटीसाठी आणि विजापूरवर त्यांनी केलेल्या आक्रमणावर चर्चा करण्यास बोलाविले. त्यानुसार शिवाजीराजे दिल्लीला पोहोचले. त्यांच्यासोबत नऊ वर्षांचा संभाजी देखील होता. परंतु दरबारात त्यांना कनिष्ठ सरदारांच्या समवेत उभे करून शिवाजीसारख्या राजांचा उपमर्द केला. या अपमानामुळे अतिशय नाराज होऊन शिवाजीराजे तडक दरबाराबाहेर पडले असता त्यांना तत्क्षणी अटक करून नजरकैदेत ठेवण्यात आले. लवकरच त्यांची रवानगी जयसिंहाचे पुत्र मिर्झाराजे रामसिंग यांच्याकडे आग्रा येथे करण्यात आली.\n" +
                "\n" +
                "\n" +
                "शिवाजीराजे दिल्ली दरबारात\n" +
                "शिवाजीबद्दल आधीपासूनच धास्ती असल्यामुळे त्यांच्यावर कडक पहारा ठेवला होता. काही दिवस निघून गेले. सुटकेसाठी प्रयत्\u200Dन फोल ठरले होते. शेवटी शिवाजीराजांनी एक योजना आखली. त्या योजनेनुसार त्यांनी आजारी पडल्याचे निमित्त केले आणि त्यांच्या प्रकृतीस्वास्थ्यासाठी विविध मंदिरांना व दर्ग्यांना मिठाईचे पेटारे पाठविण्यात येऊ लागले. सुरुवातीला पहारेकरी प्रत्येक पेटारा बारकाईने तपासून पहात पण काही दिवसांनी यात ढिलाई होऊ लागली. नंतर त्यांनी तपासण्याचेदेखील सोडले. या गोष्टीचा फायदा घेऊन एक दिवस शिवाजीराजे आणि संभाजी एकेका पेटार्\u200Dयामध्ये बसून निसटण्यात यशस्वी झाले. कोणास संशय येऊ नये यास्तव शिवाजीराजांचा विश्वासू हिरोजी फर्जंद हा शिवरायांचे कपडे चढवून आणि त्यांची अंगठी दिसेल अशा पद्धतीने हात बाहेर काढून झोपल्याचे नाटक करीत होता. शिवराय दूरवर पोहोचल्याची खात्री आल्यावर तो देखील पहारेकर्\u200Dयांना बगल देऊन निसटला. बराच वेळ आतमध्ये काही हालचाल नाही हे वाटून पहारेकरी आत गेले असता त्यांना तेथे कोणीही आढळले नाही तेव्हा त्यांना सत्य परिस्थिती समजली. तोपर्यंत शिवाजी निसटून २४ तास झाले होते.\n" +
                "\n" +
                "आग्रा येथून शिवाजीराजांनी वेषांतर केले आणि लगोलग स्वराज्याकडे न जाता मथुरे कडे गेले, तेथे संभाजीला त्यांनी वेगळ्या मार्गाने काही दुसर्\u200Dया विश्वासू माणसांबरोबर पाठविले. एका संन्याशाच्या वेषात महाराष्ट्रात प्रवेश केला. त्यातदेखील त्यांना अनेक खबरदार्\u200Dया घ्याव्या लागल्या. ते स्वतः अतिशय लांबच्या आणि तिरकस, वाकड्या मार्गाने मजल-दरमजल करीत आले. उद्देश हाच होता की काही झाले तरी पुन्हा औरंगजेबाच्या हातात पडायचे नाही.\n" +
                "\n" +
                "यात आणखी एक गोष्ट उल्लेखनीय आहे. दिल्लीभेटीपूर्वी त्यांनी राज्यकारभारासाठी जे अष्टप्रधानमंडळ स्थापले होते, त्या मंडळाने राजांच्या अनुपस्थितीमध्ये देखील राज्याचा कारभार चोख चालविला होता. हे शिवाजीराजांचे आणि अष्टप्रधानमंडळाचे फार मोठे यश आहे.";

        p23 = "शिवाजीराजे परतल्यानंतर त्यांनी झालेल्या अपमानाचा सूड घेण्यासाठी पुरंदरच्या तहात दिलेले सर्व तेवीस किल्ले जिंकून घेतले. त्यांनी त्यातील पहिल्यांदा कोंढाणा घ्यायचे ठरवले. कोंढाण्याच्या लढाईत सुभेदार तानाजी मालुसरे यांस लढताना वीरमरण आले.";
        p24 = "६ जून इ.स. १६७४ रोजी शिवाजीराजांना रायगडावर राज्याभिषेक करण्यात आला. त्या दिवसापासून शिवाजीराजांनी शिवराज्याभिषेक शक सुरू केला आणि शिवराई हे चलन जारी केले. या शिवाय नवी कालगणना सुरू होऊन नवा शक सुरू झाला, फारसी-संस्कृत शब्दकोश बनवला गेला. यामध्ये फारसीच्या जागी संस्कृत शब्द वापरणे यासाठी हुकुम जारी केले. तसेच पंचांगशुद्धी करण्याची सक्ती केली. यासाठी कृष्ण दैवज्ञ नामक ज्योतिषी आणवला. या ज्योतिष्याने ग्रंथ लेखन करावे आणि संबंधितांना रित घालून द्यावी असा आदेश दिला. तसेच त्याज कसडून 'करणकौस्तुभ' नामक ग्रंथही लिहवून घेतला.";


        p26 = "इतिहास\n" +
                "भारतात इंग्रज येण्यापूर्वी तिथीनुसार व्यवहार होत असत. इंग्रजी राज्य आल्यावर ग्रेगरीय दिनदर्शिकेनुसार व्यवहार होऊ लागले.\n" +
                "\n" +
                "ग्रेगरीय दिनदर्शिका भारतात लागू झाल्यावर ज्यांचा जन्म झाला त्यांची जयंती तारखेने करतात. महात्मा फुले, महात्मा गांधी, डॉ. बाबासाहेब आंबेडकर, लोकमान्य टिळक या सर्व महापुरूषांचा जन्म भारतात ग्रेगरीय दिनदर्शिका लागू झाल्यावर झाला होता. त्यामुळे त्यांची जयंती तारखेने केली जाते.\n" +
                "\n" +
                "तुकाराम, बसवेश्वर, शिवाजी, तथागत बुद्ध या साऱ्यांचा जन्म भारतात ग्रेगरीय दिनदर्शिका लागू करण्यापूर्वी झालेला आहे. त्यांच्या काळात सारे व्यवहार तिथीने करत असत. त्यांचे जन्मदिवस तिथीने साजरे होतात.\n" +
                "\n" +
                "आज ज्या ग्रेगरीय दिनदर्शिकेनुसार शिवाजी महाराजांच्या जन्माची तारीख १९ फेब्रुवारी अशी निश्चित केली आहे, ते कॅलेंडर शिवाजीच्या वेळेला युरोपातसुद्धा प्रचलित नव्हते. इंग्रजांनी ग्रेगेरियन कॅलेंडर १७५२ साली स्वीकारले, तोपर्यंत त्यांच्या साम्राज्यात जुलियन दिनदर्शिका अधिकृत होती. जुलियन दिनदर्शिकेतील कालगणना व ग्रगरीय दिनदर्शिकेतील कालगणना यांच्यात १७०० सालपर्यंत १० दिवसांचा तर १७०० सालापासून पुढे ११ दिवसांचा फरक येतो. (जुलियन दिनदर्शिका पुढे गेली होती.) त्यामुळे जुलियन दिनदर्शिकेनुसार निर्धारित १९ फेब्रुवारी ही तारीख १० - ११ दिवसांनी चुकते. अनेक ठिकाणी शिवाजी महाराजांच्या जन्मावेळी जी कालगणना प्रचलित होती त्यानुसार शिवाजी जयंती तिथीनुसार साजरी केील जाते. सरकारी जयंती तारखेनुसार असते.\n" +
                "\n" +
                "शिवाजीचा जन्म १६२७ साली झाला अशी जेव्हा मान्यता होती तेव्हा जयंतीची तिथी वैशाख शुद्ध तृतीया येत असे. जेव्हा जन्मसाल १६३० नक्की झाले तेव्हा तिथी फाल्गुन वद्य तृतीया येऊ लागली. शिवाजीच्या जन्मावेळी जर ग्रेगेरीय दिनदर्शिका प्रचलीत असती तर १६३० सालची फाल्गुन वद्य तृतीया १९ फेब्रुवारीला आली असती. म्हणून, २००१ सालापासून १९ फेब्रुवारी ह्या तारखेला सरकारी शिवजयंती साजरी होते. पहा : शिवाजीच्या जन्मतारखेचा वाद\n" +
                "\n" +
                "सण\n" +
                "शिवाजीच्या जयंतीला महाराष्ट्रात शिवजयंती म्हणतात. शिवाजीच्या जन्मतारखेबद्दल वाद असल्याने शिवजयंती महाराष्ट्रात वर्षभरात किमान दोनदा साजरी होते. त्या दिवशी दिवसभर ढोल-ताशे वाजवीत मिरवणुका निघतात आणि शिवाजीच्या पुतळ्यांना हार घालण्याचा कार्यक्रम होतो. मुंबईसारख्या शहरात शिवजयंतीच्या मिरवणुकीत १००च्या वर मालमोटारी व त्यांवर देखावे असतात.\n" +
                "\n" +
                "भिवंडी आणि मालेगाव येथे या दिवशी अनेकदा दंगली झाल्या. इ.स. १९७० साली भिवंडीत शिवजयंतीची मिरवणूक मशिदीसमोर फार काळ रेंगाळल्यामुळे तुफान दंगल झाली. त्यामुळे भिवंडीत शिवजयंतीची मिरवणूक काढायला १४ वर्षांची बंदी घातली गेली. इ.स. १९८४ साली परवानगी मिळाली आणि त्यावर्षी झालेल्या भीषण दंगलीत अनेक वाहने जळून खाक झाली. त्यामुळे आता मिरवणुकीत सामील होण्यास वाहने मिळत नाहीत. प्रत्येक शिवजयंतीच्या एक आठवडा आधी भिवंडीतले झोपडपट्टीवासी आपले चंबूगबाळे आवरून झोपडी सोडून परगावी जातात.";


        p27 = "ईस्ट इंडिया कंपनी-Factory Records\n" +
                "डच ईस्ट इंडिया कंपनी-Factory Records\n" +
                "छत्रपति शिवाजी महाराज (लेखक - दि.वि. काळे)\n" +
                "झुंज नियतीशी (अनुवादित, अनुवादक - इंद्रायणी चव्हाण, मूळ इंग्रजी - Challenging Destiny : Chhatrapati Shivaji - A Biography, लेखक - मेधा देशमुख-भास्करन)\n" +
                "डाग रजिस्टर- डच पत्रव्यवहार\n" +
                "श्री भोसले कुलाचा वंशवृक्ष (इंद्रजित सावंत), (२०१७)\n" +
                "मराठा-स्वराज्य संस्थापक श्रीशिवाजी महाराज (१९३२); लेखक - चिंतामण विनायक वैद्य\n" +
                "राजा शिवछत्रपती (लेखक - ब.मो. पुरंदरे, १९६५)\n" +
                "छत्रपती शिवाजी महाराज' प्रकाशन १९७० मध्ये यशवंतराव चव्हाण यांच्या हस्ते   (पूर्वार्ध व उत्तरार्ध,पृष्ठसंख्या १२००) लेखक: वासुदेव सीताराम बेंद्रे.\n" +
                "छत्रपती शिवाजी महाराजांच्या गोष्टी (बालवाङ्मय, श्रीकांत गोवंडे)\n" +
                "श्री राजा शिवछत्रपती-खंड १ & २, (गजानन भास्कर मेहेंदळे)\n" +
                "शककर्ते शिवराय, खंद १ आणि २ (१९८२) लेखक - विजय देशमुख : (हिंदी अ्नुवादसुद्धा उपलब्ध)\n" +
                "शिवकालीन पत्रसार संग्रह खंड १ व २ : भारत इतिहास संशोधक मंडळ\n" +
                "शिवकालीन स्त्रियांचे अधिकार (नीलिमा भावे)\n" +
                "शिव छत्रपतींचे चरित्र (रघुनाथ विनायक हेरवाडकर)\n" +
                "शिवछत्रपतींच्या समाधीचा शोध व बोध (३री आवृत्ती) (इंद्रजित सावंत?)\n" +
                "Shivaji - The Great Guerrilla (R..D. Palsokar)\n" +
                "Shivaji - ((सर यदुनाथ सरकार)\n" +
                "शिवाजी आणि रामदास (सुनील चिंचोळकर)\n" +
                "शिवाजी व शिवकाल (सर यदुनाथ सरकार; मूळ इंग्रजी; मराठी अनुवाद वि. स. वाकसकर, १९३०)\n" +
                "शिवाजी द ग्रँड रिबेल (इंग्रजी, डेनिस किंकेड, १९३०), नवी आवृुत्ती - ‘द ग्रँड रिबेल : अ\u200Dॅन इम्प्रेशन ऑफ शिवाजी’ (२०१५)\n" +
                "शिवाजी निबंधावली खंड १ व २\n" +
                "शिवाजी महाराजांचे अर्थशास्त्र (लेखक -प्रा. नामदेवराव जाधव)\n" +
                "क्षत्रियकुलावतंस छत्रपति श्रीशिवाजी महाराज ह्यांचे चरित्र (लेखक - कृष्णराव अर्जुन केळूसकर). हे शिवाजीचे मराठीतले १९०६ साली लिहिलेले पहिले चरित्र.\n" +
                "शिवाजी-निबंधावली भाग १ व २ : या ग्रंथात, श्री शिवाजी महाराजांच्या चरित्रावर अप्रत्यक्षपणे प्रकाश पाडणारे व शिवकालीन परिस्थितीचे वर्णन करणारे अनेक लेख संग्रहित केले आहेत.\n" +
                "या ग्रंथात पांडुरंग वामन काणे, शंकर दामोदर पेंडसे, गोविंद रामचंद्र राजोपाध्ये, रामकृष्ण परशुराम सबनीस, यशवंत खुशाल देशपांडे, वासुदेव आत्माराम देशप्रभू, जनार्दन सखाराम करंदीकर, महामहोपाध्याय रायबहादूर गौरीशंकर ओझा, शंकर वामन दांडेकर, श्रीक्रुष्ण व्यंकटेश पुणतांबेकर, भास्कर वामन भट, शिवराम काशीनाथ ओक, सुरेन्द्रनाथ सेन, पंडित वैद्यनाथन शास्त्री तसेच Sir Charles Malet अशा अनेक थोर इतिहास अभ्यासकांचे छत्रपती शिवाजीमहाराजांच्या संबंधित विविध विषयांवरील लेख आहेत.\n" +
                "\n" +
                "शिवाजीची कर्नाटक मोहीम (एम.एस. नरवणे)\n" +
                "शिवाजी जीवन आणि काळ (गजानन भास्कर मेहेंदळे)\n" +
                "Shivaji Maharaj the greatest (हेमंतराजे गायकवाड)\n" +
                "शिवाजी महाराजांचा पुरुषार्थ (श्रीपाद दामोदर सातवळेकर)\n" +
                "शिवाजी महाराजांची डायरी (नामदेवराव जाधव)\n" +
                "शिवाजी महारांची पत्रे(\n" +
                "शिवाजी महाराजांचे अर्थशास्त्र (नामदेवराव जाधव)";
        p29 = "काफीखान आणि इतर इतिहासकारांनी शिवाजीच्या स्त्रीदाक्षिण्याबद्दल भरभरून लिहिले आहे.\n" +
                "इंग्रजी फॅक्टरी रेकॉर्ड्\u200Cसमध्ये म्हटले आहे की शिवाजी स्त्रियांना अभय देतो हे सर्वश्रुत असल्याने युद्धामध्ये पराभव झाल्यानंतर शत्रुपक्षातील मातब्बर माणसे स्त्रीवेष घालून पळून जात.\n" +
                "शिवाजीच्या समकालीन इंग्रज, डच, फ्रेन्च, पोर्तुगीज आणि इटालियन प्रवाशांनी शिवाजीची तुलना जगाच्या इतिहासात अजरामर झालेल्या ॲलेक्झांडर, हॅनिबल, ज्युलियस सीझर, सरटोरियस यांच्याशी केली आहे. पण या थोर व्यक्तींमध्ये शौर्याव्यतिरिक्त दोषही होते. शिवाजी सर्वगुणसंपन्\u200Dन होता. शिवरायांचे शौर्य, कल्पकता, संघटनाकौशल्य, राजधर्मपालन, स्त्रीदाक्षिण्य इत्यादी गुणांनी पाच शतके पारतंत्र्यात पडलेल्या देशास स्वातंत्र्य मिळवून दिले. पाश्चात्त्य राज्यकर्त्यांमध्ये दिसून येणाऱ्या राज्यलोभ, आसक्ती, व्यसनाधीनता द्वेष. लंपटपणा अशा अवगुणांपासून शिवाजीचे जीवन अलिप्त होते.";
        p30 = "पुस्तकाचे नाव : शिवदिग्विजय (रचनाकाळ- इ.स. १८१८). टीकेचा तपशील :-\n" +
                "\"शिवाजीची पत्\u200Dनी सोयराबाई हिने आपल्या पतीवर विषप्रयोग केला, आणि त्यामुळे त्यांचा मृत्यू झाला.\"\n" +
                "\n" +
                "पुस्तकाचे नाव : अनुपुराण. या काव्याचा कवी- परमानंदाचा नातू गोविंदा. काव्याचा रचनाकाळ- इ.स. १७४५. टीकेचा तपशील :-\n" +
                "\"शिवाजीची पत्\u200Dनी सोयराबाई ही कलीची दूती असलेली राक्षसी होती. तिने केलेली सर्व कृत्ये स्वार्थापोटी केली होती. स्वाभिमान राखण्यासाठी व आपल्या शौर्याला वाट करून देण्यासाठी संभाजी मोगलांना मिळाला\"\n" +
                "’अनुपुराण’ विश्वासार्ह नसल्याचे जदुनाथ सरकार आणि रियासतकार सरदेसाई यांनी म्हटले आहे.\n" +
                "सोयराबाईचा सवतीमत्सर, राजकारणातील तिची लुडबूड, शिवाजी महाराजांचे नैराश्य व बायकोच्या तंत्राने वागण्याची प्रवृत्ती या ’अनुपुराणा’ने सांगितलेल्या गोष्टींचे पडसाद रणजित देसाईंनी लिहिलेल्या ’श्रीमान योगी’ या पुस्तकात पडले आहेत.\n" +
                "\n" +
                "पुस्तकाचे नाव : डच संग्रहातील डाग रजिस्टर (इ.स. १८८०; पृष्ठ क्रमांक ७२४ ते ७२९ पानांवरच्या २३-१०-१६८० च्या नोंदी). टीकेचा तपशील :-\n" +
                "\"गोवळकोंड्याहून आताच बातमी आली, की शिवाजीच्या दुसऱ्या बायकोने शिवाजीवर विषप्रयोग केला असावा आणि आणि तिचा लहान मुलगा राजाराम याला गादीवर बसविण्याचा घाट घातला होता. त्याला तुरुंगात टाकले आहे आणि थोरला मुलगा संभाजी राज्य करीत आहे.\"\n" +
                "\n" +
                "पुस्तकाचे नाव : मनुचीने लिहिलेला ग्रंथ- ’स्टोरिया द मोगोर’ (खंड २ रा, पृष्ठ २३२). टीकेचा तपशील :-\n" +
                "\"संभाजीविरुद्ध अनेक अधिकाऱ्यांच्या तक्रारी येऊ लागल्या, व शिवाजीस भीती पडली की त्या वेळीच थांबवल्या नाहीत तर राज्यातील प्रधान व अधिकारी बंड करतील. त्यामुळे शिवाजीने संभाजीस कैद करून एका किल्ल्यावर ठेवण्याचे ठरविले आणि धाकट्या मुलास आपल्यामागे राज्य देण्याचे निश्चित केले. पण संभाजीस आपल्या बापाच्या आज्ञांचा सुगावा लागला आणि त्याने वेळीच पलायन केले आणि आश्रयासाठी औरंगजेबाचा दरबार गाठला. घरच्या भांडणावर पडदा टाकण्यासाठी शिवाजीने संभाजीला मोगलांकडे पाठविले नव्हते.\"\n" +
                "\n" +
                "मुंबईकर इंग्रजांच्या २८-४-१६८०च्या पत्रातील माहिती :-\n" +
                "\"शिवाजीच्या निधनाची निश्चित बातमी मिळाली. त्याला रक्ताची जोरात उलटी झाल्याने त्याचा मृत्यू ओढवला.\"\n" +
                "\n" +
                "’मासिरे आलमगीर’ या पर्शियन लेखातील माहिती :-\n" +
                "\"शिवाजी घोड्यावरून उतरला व अतिउष्णतेमुळे रक्ताची दोन वेळा उलटी झाल्याने तो मरण पावला.\"\n" +
                "\n" +
                "इगेन वी या लेखकाच्या पुस्तकातील मजकूर :-\n" +
                "\"शहाजी हा निजामाच्या राज्याचा सेवक होता आणि त्याने पुणा परगणा दादोजी कोंडदेवावर सोपवून टाकला होता.\"\n" +
                "हे तर्कट कोणत्याही कागदपत्रांत सापडत नाही. खरी गोष्ट अशी होती की \"कर्नाटकातील आदिलशाही अत्याचाराने शहाजी अत्यंत व्यथित झाला होता. आदिलशहा, निजामशाहा आणि मोगल यांच्याकडे त्याने नोकऱ्या पत्करल्या. पण अविवेकी लहरी सुलतानी दरबारांतील हिंदुद्वेषी खुनशी मुसलमान सरदार, जनानखान्यातील कपट कारस्थाने या सर्वांमुळे शहाजीच्या निष्ठेचे कुठेच मोल नव्हते. त्यामुळे त्याने शिवाजीला सह्याद्रीने वेढलेल्या महाराष्ट्रात पाठविले व त्याच्याकडून आपल्या हयातीतच हिंदवी स्वराज्य निर्माण करण्याचे स्वप्न प्रत्यक्षात आणले. शहाजीला याची किंमतही मोजावी लागली. इ.स. १६४८ व १६६३मध्ये त्याला दोनदा कैद भोगावी लागली. दोन्ही वेळा शहाजी कैदेतून सहीसलामत सुटला. मात्र आदिलशहाने सिद्दी जौहर, सिद्दी यातून, मसूद आणि बहलोलखान या सरदारांना जबर शिक्षा केल्या. शहाजीला अशी शिक्षा करण्याचे आदिलशहाला धाडस झाले नाही, कारण शिवाजी बळ एवढे वाढले होते की, मोगलांविरुद्ध लढण्यासाठी शिवाजीची मदत घेण्याचे आदिलशहाने ठरविले होते. असा तहही त्याने केला होता.\n" +
                "\n" +
                "व्हलेंटाइन, ग्रॅन्ट डफ, जे स्कॉट या इंग्रज इतिहासकारांची पुस्तके : टीकेचा तपशील :-\n" +
                "\"अफझलखानाला शिवाजीने विश्वासघाताने मारले\"\n" +
                "\n" +
                "बंगाली इतिहासकार जदुनाथ सरकार यांचे पुस्तक : टीकेचा तपशील :-\n" +
                "\"शिवाजी अक्षरशत्रू होता, त्याला मुळीच लिहिता वाचता येत नव्हते.\"\n" +
                "या इंग्रजी आणि बंगाली इतिहासकारांनी केलेल्या विधानांना वि.का. राजवाडे, शेजवलकर, सेतुमाधव पगडी, दत्तो वामन पोतदार आणि डॉ. बाळकृष्ण या नामवंत संशोधकांनी पुराव्यांसहित समर्पक उत्तरे देऊन अशा आक्षेपांतील फोलपणा सिद्ध केला आहे.\n" +
                "\n" +
                "भारतात असकारितेची चळवळ चालू होती त्या काळातील इंग्रजी वृत्तपत्रांतून प्रकट होणारी तत्कालीन भारतीय राजकारण्यांची मते :-\n" +
                "\" अफझुलखानाचा वध आणि सुरतेची लूट हे शिवाजीच्या हातून घडलेले अक्षम्य गुन्हे आहेत.\"\n" +
                "साहित्यसम्राट न.चिं. केळकरांनी असल्या विधानांचा खरपूस समाचार घेतला होता.\n" +
                "\n" +
                "उत्तर प्रदेशातील सुलतानपूर येथील सय्यद तफझुल दाऊद सईदखान नावाच्या वकिलाने इ.स. १९३५ साली ’रिअल शिवाजी’ नावाचा ग्रंथ लिहिला होता. त्यात एका डच पत्रातील उल्लेख छापून शिवाजीराजांची प्रतिमा डागाळेल अशा तर्\u200Dहेची शिवाजीच्या कुटुंबातील स्त्रियांसंबंधांत खोटीनाटे बदनामीकारक विधाने केली होती. भालजी पेंढारकरांनी या विरुद्ध कोल्हापुरात बंड पुकारले होते. कोल्हापूर संस्थानचे दिवाण रावबहादूर डी,ए, सुर्वे यांनी या पुस्तकावर बंदी घातली आणि जनतेच्या रोषाला आवर घातला. सय्यदच्या या पुस्तकातील मजकुराचे खंडन डॉ.बाळकृष्ण यांनी त्यांच्या ’शिवाजी द ग्रेट’ या ग्रंथात केले आहे.\n" +
                "पंडित नेहरूंच्या ’डिस्कव्हरी ऑफ इंडिया’ या पुस्तकात \"शिवाजी हा एक दरवडेखोर आणि लुटारू होता\" असे म्हटले आहे.";
        p31 = "मालोजीराजे भोसले\t\n" +
                "जिजाबाई भोसले\t\n" +
                "शहाजीराजे भोसले\t\n" +
                "शरीफजीराजे भोसले\t\n" +
                "संभाजी शहाजी भोसले\t\n" +
                "शिवाजीराजे भोसले\t\n";
        id = new String[]{"0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30"};

        content = new String[]{p1, p2, p3, p4, p7, p8, p9, p12, p13, p14, p15, p16, p17, p18, p19, p20, p21, p22, p23, p24, p26, p27, p29, p30, p31};
        titles = new String[]{t1, t2, t3, t4, t7, t8, t9, t12, t13, t14, t15, t16, t17, t18, t19, t20, t21, t22, t23, t24, t26, t27, t29, t30, t31};

        final ViewPager myViewPager = findViewById(R.id.myViewPager);
        drawer_layout = findViewById(R.id.drawer_layout);
        builderSingle = new AlertDialog.Builder(HistoryActivity.this);
        builderSingle.setTitle("फॉन्ट आकार निवडा");

        final ArrayAdapter<String> arrayAdapter = new ArrayAdapter<String>(HistoryActivity.this, android.R.layout.select_dialog_singlechoice);
        arrayAdapter.add("१४");
        arrayAdapter.add("१६");
        arrayAdapter.add("१८");
        arrayAdapter.add("२०");
        arrayAdapter.add("२२");

        builderSingle.setNegativeButton("रद्द करा\n", new DialogInterface.OnClickListener() {
            @Override
            public void onClick(DialogInterface dialog, int which) {
                dialog.dismiss();
            }
        });
        rec_index = findViewById(R.id.rec_index);
        RecyclerView.LayoutManager layoutManager = new
                LinearLayoutManager(getApplicationContext());
        rec_index.setLayoutManager(layoutManager);
        rec_index.setItemAnimator(new DefaultItemAnimator());
        IndexAdapter photoGalleryAdapter = new IndexAdapter(id, HistoryActivity.this, titles, myViewPager, drawer_layout);
        rec_index.setAdapter(photoGalleryAdapter);
        final BookOnboardingPagerAdapter pagerAdapter = new BookOnboardingPagerAdapter(getSupportFragmentManager());
        myViewPager.setAdapter(pagerAdapter);
        myViewPager.setCurrentItem(SharedPref.getLastPageHistory(this));
        myViewPager.addOnPageChangeListener(new ViewPager.OnPageChangeListener() {
            @Override
            public void onPageScrolled(int position, float positionOffset, int positionOffsetPixels) {
                if (tts != null) {
                    tts.shutdown();
                }
            }

            @Override
            public void onPageSelected(int position) {


                SharedPref.saveLastPageHistory(HistoryActivity.this, position);
                SharedPref.saveHistoryNotification(HistoryActivity.this, titles[position]);

            }

            @Override
            public void onPageScrollStateChanged(int state) {

            }
        });
        builderSingle.setAdapter(arrayAdapter, new DialogInterface.OnClickListener() {
            @Override
            public void onClick(DialogInterface dialog, int which) {
                int size = 12;

                switch (which) {
                    case 0:
                        size = 14;
                        break;
                    case 1:
                        size = 16;
                        break;
                    case 2:
                        size = 18;
                        break;
                    case 3:
                        size = 20;
                        break;
                    case 4:
                        size = 22;
                        break;
                }
                SharedPref.saveFontSize(HistoryActivity.this, size);
                myViewPager.setAdapter(pagerAdapter);
                myViewPager.setCurrentItem(SharedPref.getLastPageHistory(HistoryActivity.this));
                pagerAdapter.notifyDataSetChanged();


                dialog.dismiss();

            }
        });
        ImageView img_font_size = findViewById(R.id.img_font_size);
        ImageView img_swipe_left = findViewById(R.id.img_swipe_left);
        ImageView img_swipe_right = findViewById(R.id.img_swipe_right);
        ImageView img_back = findViewById(R.id.img_back);
        ImageView img_audio = findViewById(R.id.img_audio);

        ImageView img_index = findViewById(R.id.img_index);
        img_index.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                drawer_layout.openDrawer(GravityCompat.END);
            }
        });

        img_audio.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                int currentPosition = myViewPager.getCurrentItem();
                final ArrayList<String> mylist = new ArrayList<String>();
                toSpeak = content[currentPosition];
                int characterNumber = 4000;
                if (toSpeak.length() > characterNumber) {
                    int maxlengthDivide = toSpeak.length() / characterNumber;

                    int maxlengthMod = toSpeak.length() % characterNumber;

                    if (maxlengthMod != 0) {
                        maxlengthDivide = maxlengthDivide + 1;
                    }
                    int startIndex = 0;
                    int endIndex = characterNumber;

                    for (int j = 0; j < maxlengthDivide; ) {
                        String trimString = toSpeak.substring(startIndex, endIndex);
                        mylist.add(trimString);
                        j = j + 1;
                        startIndex = endIndex + 1;
                        if (j == maxlengthDivide - 1) {
                            endIndex = maxlengthMod + endIndex;

                        } else {
                            int multiple = j + 1;
                            endIndex = characterNumber * multiple;
                        }
                    }
                    current_Speak_position = 0;
                    toSpeak = mylist.get(0);

                }


                tts = new TextToSpeech(HistoryActivity.this, new TextToSpeech.OnInitListener() {

                    @Override
                    public void onInit(int status) {
                        Locale loc = new Locale("mr", "IN");

                        tts.setLanguage(loc);
                        ttsParams = new HashMap<String, String>();
                        ttsParams.put(TextToSpeech.Engine.KEY_PARAM_UTTERANCE_ID,
                                HistoryActivity.this.getPackageName());
                        tts.speak(toSpeak, TextToSpeech.QUEUE_FLUSH, ttsParams);
                        tts.setOnUtteranceCompletedListener(new TextToSpeech.OnUtteranceCompletedListener() {

                            @Override
                            public void onUtteranceCompleted(final String utteranceId) {
                                current_Speak_position++;
                                if (current_Speak_position < mylist.size()) {
                                    toSpeak = mylist.get(current_Speak_position);
                                    tts.speak(toSpeak, TextToSpeech.QUEUE_FLUSH, ttsParams);
                                }

                            }
                        });

                    }
                });


            }
        });
        img_back.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                finish();
            }
        });


        img_font_size.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                if (tts != null && tts.isSpeaking()) {
                    AlertDialog.Builder builderSingle1 = new AlertDialog.Builder(HistoryActivity.this);
                    builderSingle1.setTitle("ऑडिओ चालू आपण आता फॉन्ट बदलू शकत नाही");
                    builderSingle1.setPositiveButton("ठीक आहे", new DialogInterface.OnClickListener() {
                        @Override
                        public void onClick(DialogInterface dialog, int which) {
                            dialog.dismiss();
                        }
                    });
                    builderSingle1.show();
                } else {
                    builderSingle.show();

                }


            }
        });
        img_share.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                int currentPosition = myViewPager.getCurrentItem();
                String shareContent = "*" + getResources().getString(R.string.history) + "*" + "\n\n" + "*" + titles[currentPosition] + "*" + "\n\n" + content[currentPosition];
                Uri uriUrl = Uri.parse("whatsapp://send?text=" + Constant.PLAYSTORE_URL + shareContent + "");
                Intent launchBrowser = new Intent(Intent.ACTION_VIEW, uriUrl);
                try {
                    startActivity(launchBrowser);

                } catch (android.content.ActivityNotFoundException ex) {
                    Toast.makeText(getApplicationContext(), "Whatsapp is not installed on this device", Toast.LENGTH_SHORT).show();
                }

            }
        });

        Drawable closeDrawable;
        if (Build.VERSION.SDK_INT >= Build.VERSION_CODES.LOLLIPOP) {
            closeDrawable = getResources().getDrawable(R.drawable.ic_close_black_24dp, getApplicationContext().getTheme());
        } else {
            closeDrawable = getResources().getDrawable(R.drawable.ic_close_black_24dp);
        }

        int color;
        if (Build.VERSION.SDK_INT >= Build.VERSION_CODES.M) {
            color = getResources().getColor(R.color.colorPrimary, getApplicationContext().getTheme());

        } else {
            color = getResources().getColor(R.color.colorPrimary);
        }
        BubbleShowCaseBuilder builder_audio = new BubbleShowCaseBuilder(this) //Activity instance
                .title("ऑडिओ ऐका\n") //Any title for the bubble view
                .description("ऑडिओ ऐकण्यासाठी येथे क्लिक करा\n") //More detailed description
                .arrowPosition(BubbleShowCase.ArrowPosition.TOP) //You can force the position of the arrow to change the location of the bubble.
                .backgroundColor(color) //Bubble background color
                .textColor(Color.WHITE) //Bubble Text color
                .titleTextSize(17) //Title text size in SP (default value 16sp)
                .descriptionTextSize(15) //Subtitle text size in SP (default value 14sp)
                //                .image(imageDrawable) //Bubble main image
                .closeActionImage(closeDrawable) //Custom close action image
                .showOnce("1") //Id to show only once the BubbleShowCase
                .targetView(img_audio);

        BubbleShowCaseBuilder builder_font = new BubbleShowCaseBuilder(this) //Activity instance
                .title("अक्षराचा आकार\n") //Any title for the bubble view
                .description("फॉन्ट आकार बदलण्यासाठी येथे क्लिक करा\n") //More detailed description
                .arrowPosition(BubbleShowCase.ArrowPosition.TOP) //You can force the position of the arrow to change the location of the bubble.
                .backgroundColor(color) //Bubble background color
                .textColor(Color.WHITE) //Bubble Text color
                .titleTextSize(17) //Title text size in SP (default value 16sp)
                .descriptionTextSize(15) //Subtitle text size in SP (default value 14sp)
                //                .image(imageDrawable) //Bubble main image
                .closeActionImage(closeDrawable) //Custom close action image
                .showOnce("2") //Id to show only once the BubbleShowCase
                .targetView(img_font_size);

        BubbleShowCaseBuilder builder_index = new BubbleShowCaseBuilder(this) //Activity instance
                .title("अनुक्रमणिका\n") //Any title for the bubble view
                .description("पूर्ण अनुक्रमणिका मिळविण्यासाठी येथे क्लिक करा\n") //More detailed description
                .arrowPosition(BubbleShowCase.ArrowPosition.TOP) //You can force the position of the arrow to change the location of the bubble.
                .backgroundColor(color) //Bubble background color
                .textColor(Color.WHITE) //Bubble Text color
                .titleTextSize(17) //Title text size in SP (default value 16sp)
                .descriptionTextSize(15) //Subtitle text size in SP (default value 14sp)
                //                .image(imageDrawable) //Bubble main image
                .closeActionImage(closeDrawable) //Custom close action image
                .showOnce("3") //Id to show only once the BubbleShowCase
                .targetView(img_index);
        BubbleShowCaseBuilder builder_share_whatsapp = new BubbleShowCaseBuilder(this) //Activity instance
                .title("सोशल मीडियावर पाठवा\n") //Any title for the bubble view
                .description("शेअर करण्यासाठी येथे क्लिक करा\n") //More detailed description
                .arrowPosition(BubbleShowCase.ArrowPosition.TOP) //You can force the position of the arrow to change the location of the bubble.
                .backgroundColor(color) //Bubble background color
                .textColor(Color.WHITE) //Bubble Text color
                .titleTextSize(17) //Title text size in SP (default value 16sp)
                .descriptionTextSize(15) //Subtitle text size in SP (default value 14sp)
                //                .image(imageDrawable) //Bubble main image
                .closeActionImage(closeDrawable) //Custom close action image
                .showOnce("4") //Id to show only once the BubbleShowCase
                .targetView(img_share);

        BubbleShowCaseBuilder builder_swipeLeft = new BubbleShowCaseBuilder(this) //Activity instance
                .title("डावीकडे स्वाइप करा\n") //Any title for the bubble view
                .description("मागील भाग पाहण्यासाठी डावीकडे स्वाइप करा\n") //More detailed description
                .arrowPosition(BubbleShowCase.ArrowPosition.TOP) //You can force the position of the arrow to change the location of the bubble.
                .backgroundColor(color) //Bubble background color
                .textColor(Color.WHITE) //Bubble Text color
                .titleTextSize(17) //Title text size in SP (default value 16sp)
                .descriptionTextSize(15) //Subtitle text size in SP (default value 14sp)
                //                .image(imageDrawable) //Bubble main image
                .closeActionImage(closeDrawable) //Custom close action image
                .showOnce("5") //Id to show only once the BubbleShowCase
                .targetView(img_swipe_left);


        BubbleShowCaseBuilder builder_swipeRight = new BubbleShowCaseBuilder(this) //Activity instance
                .title("उजवीकडे स्वाइप करा\n") //Any title for the bubble view
                .description("पुढील भाग पाहण्यासाठी उजवीकडे स्वाइप करा\n") //More detailed description
                .arrowPosition(BubbleShowCase.ArrowPosition.TOP) //You can force the position of the arrow to change the location of the bubble.
                .backgroundColor(color) //Bubble background color
                .textColor(Color.WHITE) //Bubble Text color
                .titleTextSize(17) //Title text size in SP (default value 16sp)
                .descriptionTextSize(15) //Subtitle text size in SP (default value 14sp)
                //                .image(imageDrawable) //Bubble main image
                .closeActionImage(closeDrawable) //Custom close action image
                .showOnce("6") //Id to show only once the BubbleShowCase
                .targetView(img_swipe_right);


        new BubbleShowCaseSequence()
                .addShowCase(builder_audio) //First BubbleShowCase to show
                .addShowCase(builder_font) // This one will be showed when firstShowCase is dismissed
                .addShowCase(builder_index) // This one will be showed when secondShowCase is dismissed
                .addShowCase(builder_share_whatsapp) // This one will be showed when secondShowCase is dismissed
                .addShowCase(builder_swipeLeft) // This one will be showed when secondShowCase is dismissed
                .addShowCase(builder_swipeRight) // This one will be showed when secondShowCase is dismissed
                .show(); //Display the ShowCaseSequence


    }


    public class BookOnboardingPagerAdapter extends FragmentPagerAdapter {
        ArrayList<BookPageIntroFragment> fragments = new ArrayList<BookPageIntroFragment>();


        public BookOnboardingPagerAdapter(FragmentManager fm) {
            super(fm);

            for (int i = 0; i < titles.length; i++) {
                BookPageIntroFragment frag = BookPageIntroFragment.newInstance(titles[i], content[i]);
                fragments.add(frag);
            }
        }


        @Override
        public Fragment getItem(int position) {
            return fragments.get(position);
        }

        @Override
        public int getCount() {
            return fragments.size();
        }
    }

}
